[
  {
    "title": "Mindaugas on the Road – Girteka Group",
    "description": "The project was designed to break down barriers between management and administration employees and to strengthen employer branding by authentically showcasing the real life of truck drivers and the benefits of working at Girteka. Over two weeks, the CEO completed a full international route from Lithuania to Spain and back, with every stage of the journey documented in real time.",
    "area": "Employer Branding, Communication & Digital Campaign",
    "key_activities": [
      "Creating concept and execution plan",
      "Setting up a daily video workflow to capture, edit, and publish content highlighting both challenges and amenities for drivers",
      "Coordinating mobile technical support for on-the-road production",
      "Managing real-time social media communication and performance campaigns",
      "Analyzing and reporting progress and results with dedicated surveys"
    ],
    "results": [
      "Over 2 million organic video views",
      "300% year-over-year increase in social engagement",
      "85% more qualified leads generated directly from campaign activities"
    ]
  },
  {
    "title": "3‑Year Brand Awareness & Preference Campaign – ROCKWOOL CEE",
    "description": "A comprehensive, multichannel campaign executed across Central and Eastern Europe to systematically build brand awareness and preference among both installers and end customers.",
    "area": "Marketing Campaign, Loyalty Programs & B2B Incentives",
    "key_activities": [
      "Coordinating TV advertising, digital campaigns, and direct lead generation actions, fully integrated with ongoing B2B sales projects and trade marketing incentives",
      "Managing an installer loyalty program, content marketing, and targeted campaigns to address key market segments with tailored messaging",
      "Aligning all marketing efforts with the sales team and monitoring real-time campaign performance to quickly optimize activities"
    ],
    "results": [
      "+17 percentage points increase in brand awareness",
      "+15 percentage points increase in brand preference",
      "10% year-on-year sales growth over the campaign period"
    ]
  },
  {
    "title": "Rock Town Gamification Program – ROCKWOOL",
    "description": "A targeted engagement program for dealers and contractors, using gamification to drive both sales activity and product education.",
    "area": "Product Marketing, Loyalty Programs & B2B Incentives",
    "key_activities": [
      "Integrating the mobile game with overall sales and product strategy by setting personalized sales targets for each participant, directly linking gameplay achievements to strategic business objectives and the promotion of priority product lines",
      "Implementing gamification mechanics such as points, badges, and leaderboards to boost ongoing engagement and foster healthy competition among users",
      "Using the platform to communicate and reinforce the Group's updated value proposition, ensuring clear messaging around product benefits and differentiation",
      "Integrating the program seamlessly with all trade marketing activities for dealers and loyalty marketing for contractors, aligning incentives and communications across multiple channels"
    ],
    "results": [
      "Up to 10% sales increase (depending on product segment)",
      "500 active player-customers regularly participating in the program"
    ]
  },
  {
    "title": "Light-Wool & External Wall Insulation Relaunch – ROCKWOOL",
    "description": "A practical, market-focused relaunch of the Light-Wool and External wall insulation portfolio, designed to differentiate and boost product competitiveness and support sales teams in key growth segments.",
    "area": "Rebranding & Positioning, Marketing Campaigns, Product Marketing",
    "key_activities": [
      "Redefining the value proposition and updating technical specs to address specific market needs and regulatory requirements",
      "Upgrading product packaging for clearer on-shelf communication and enhanced logistics",
      "Developing educational materials and training sessions for installers to speed up product adoption on site",
      "Launching dealer incentive programs, running a multi-country roadshow, and coordinating a dedicated relaunch event to generate direct demand and feedback from the market"
    ],
    "results": [
      "6% year-on-year sales growth in the category"
    ]
  },
  {
    "title": "BuildDesk SaaS Launch",
    "description": "A pioneering project: one of Poland's first SaaS startups (launched in 2008), delivering automation tools for energy performance certification and audits.",
    "area": "Marketing Campaigns, Product Marketing, Loyalty Programs & B2B incentives",
    "key_activities": [
      "Building a new software brand from scratch, including product development, onboarding processes, and customer support for energy auditors and industry professionals",
      "Developing dedicated software for generating energy certificates and conducting audits, with features tailored to support efficiency, accuracy, and compliance in daily operations",
      "Executing a comprehensive introduction plan: running training sessions and events for users, delivering targeted communication and performance marketing activities, as well as PR and direct customer communications to drive market adoption"
    ],
    "results": [
      "Over 500 active customers annually in the first years",
      "Achieved a monopoly position in the Polish energy performance software market"
    ]
  },
  {
    "title": "Sixth Fuel Campaign – ROCKWOOL",
    "description": "A multi-year, nationwide thought leadership campaign reframing saved energy as the \"sixth fuel\". Highlighting the value of preventing energy loss, especially through effective insulation, as a practical solution for environmental, economic, and social benefits.",
    "area": "Thought Leadership Campaign",
    "key_activities": [
      "Designing and delivering an educational program that positioned energy saving through loss prevention (e.g. proper insulation) as the most effective and accessible way to reduce costs and emissions — targeting both homeowners and public sector stakeholders",
      "Producing high-impact reports and public opinion research, and organizing university competitions to expose the scale of energy waste, and shift perceptions around energy efficiency",
      "Running integrated communication and PR campaigns — including targeted media outreach, dedicated events for journalists, and constant presence in public debate — to amplify campaign reach and position ROCKWOOL as a trusted voice in energy transition"
    ],
    "results": [
      "Over 1,000 media and online mentions generated during the campaign every year",
      "37% increase in public understanding of energy efficiency (based on pre- and post-campaign research)",
      "Green Apple Award (international recognition)"
    ]
  },
  {
    "title": "Responsible Logistics Podcast & Newsletter – Girteka Group",
    "description": "A practical content platform positioning Girteka as a credible source for sustainable logistics — built on expert interviews, regulatory know-how, and operational best practices.",
    "area": "Thought Leadership Campaign",
    "key_activities": [
      "Launching an in-house podcast and editorial newsletter, focusing on practical and regulatory aspects of green transport (ESG, battery-electric trucks, intermodal rail, HVO100), featuring interviews with executives, NGOs, policy experts, and technology partners",
      "Integrating the content program with Girteka's Alternative Fuel Program, sustainability sales toolkit, and overall Responsible Logistics brand positioning to maximize commercial relevance and operational impact",
      "Promoting episodes and key insights across owned, earned, and paid channels, using analytics to refine messaging and drive audience growth"
    ],
    "results": [
      "Over 21,000 newsletter subscribers with a consistent 40% open rate",
      "250,000+ podcast video views across distribution platforms"
    ]
  },
  {
    "title": "MathEddie – AI Math Tutor",
    "description": "An AI-powered educational project designed to support 8th-grade students in preparing for their math exam. The system uses artificial intelligence to personalize tasks and learning pace to each student's needs. It serves as an alternative to traditional tutoring – always accessible, simple to use, and motivating through gamification elements.",
    "area": "AI & EdTech, Product Development, User Experience",
    "key_activities": [
      "From concept to MVP and implementation – overseeing the vision, system architecture, and product development",
      "Bridging AI technology, education, and user experience to create an effective learning tool",
      "Designing personalized learning paths and gamification mechanics to increase student engagement",
      "Building parent dashboard with clear insights into student progress and performance",
      "Implementing AI-driven task adaptation based on individual learning patterns"
    ],
    "results": [
      "Working MVP that supports students and provides parents with clear insights into progress",
      "Currently in testing phase with pilot classrooms",
      "Validating AI-driven personalization in real educational settings"
    ],
    "website": "https://matheddie.com"
  },
  {
    "title": "Replugged – Live Rock Experience",
    "description": "A live music project that combines a passion for rock with a modern approach to event promotion. Together with the band, I built a concert brand that not only revives the greatest classics of rock music but also creates a community of fans around local events. The project focuses on delivering a complete experience – from online promotion to the live concert atmosphere.",
    "area": "Event Marketing, Brand Building, Community Management",
    "key_activities": [
      "Developing communication strategy and event marketing approach for live music events",
      "Creating visual identity across digital channels and promotional materials",
      "Bass playing and contributing to the live performance experience",
      "Building and engaging a loyal fan community through consistent brand storytelling",
      "Managing social media presence and community interactions"
    ],
    "results": [
      "A series of successful concerts in key music venues",
      "Steadily growing attendance and audience engagement at events",
      "A loyal fan community actively participating in events and online interactions"
    ],
    "website": "https://replugged.pl"
  }
]
